HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxPsi5_bf.h
/** \brief Offset for Ifx_PSI5_FDRT_Bits.ECEA */
#define IFX_PSI5_FDRT_ECEA_OFF (29u)

/** \brief Length for Ifx_PSI5_FDRT_Bits.ECEB */
#define IFX_PSI5_FDRT_ECEB_LEN (1u)

/** \brief Mask for Ifx_PSI5_FDRT_Bits.ECEB */
#define IFX_PSI5_FDRT_ECEB_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_FDRT_Bits.ECEB */
#define IFX_PSI5_FDRT_ECEB_OFF (30u)

/** \brief Length for Ifx_PSI5_FDRT_Bits.ECEC */
#define IFX_PSI5_FDRT_ECEC_LEN (1u)

/** \brief Mask for Ifx_PSI5_FDRT_Bits.ECEC */
#define IFX_PSI5_FDRT_ECEC_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_FDRT_Bits.ECEC */
#define IFX_PSI5_FDRT_ECEC_OFF (31u)

/** \brief Length for Ifx_PSI5_TSRA_Bits.CTS */
#define IFX_PSI5_TSRA_CTS_LEN (24u)

/** \brief Mask for Ifx_PSI5_TSRA_Bits.CTS */
#define IFX_PSI5_TSRA_CTS_MSK (0xffffffu)

/** \brief Offset for Ifx_PSI5_TSRA_Bits.CTS */
#define IFX_PSI5_TSRA_CTS_OFF (0u)

/** \brief Length for Ifx_PSI5_TSRA_Bits.ETB */
#define IFX_PSI5_TSRA_ETB_LEN (3u)

/** \brief Mask for Ifx_PSI5_TSRA_Bits.ETB */
#define IFX_PSI5_TSRA_ETB_MSK (0x7u)

/** \brief Offset for Ifx_PSI5_TSRA_Bits.ETB */
#define IFX_PSI5_TSRA_ETB_OFF (24u)

/** \brief Length for Ifx_PSI5_TSRA_Bits.TBS */
#define IFX_PSI5_TSRA_TBS_LEN (1u)

/** \brief Mask for Ifx_PSI5_TSRA_Bits.TBS */
#define IFX_PSI5_TSRA_TBS_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_TSRA_Bits.TBS */
#define IFX_PSI5_TSRA_TBS_OFF (27u)

/** \brief Length for Ifx_PSI5_TSRA_Bits.ACLR */
#define IFX_PSI5_TSRA_ACLR_LEN (1u)

/** \brief Mask for Ifx_PSI5_TSRA_Bits.ACLR */
#define IFX_PSI5_TSRA_ACLR_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_TSRA_Bits.ACLR */
#define IFX_PSI5_TSRA_ACLR_OFF (30u)

/** \brief Length for Ifx_PSI5_TSRA_Bits.CLR */
#define IFX_PSI5_TSRA_CLR_LEN (1u)

/** \brief Mask for Ifx_PSI5_TSRA_Bits.CLR */
#define IFX_PSI5_TSRA_CLR_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_TSRA_Bits.CLR */
#define IFX_PSI5_TSRA_CLR_OFF (31u)

/** \brief Length for Ifx_PSI5_TSRB_Bits.CTS */
#define IFX_PSI5_TSRB_CTS_LEN (24u)

/** \brief Mask for Ifx_PSI5_TSRB_Bits.CTS */
#define IFX_PSI5_TSRB_CTS_MSK (0xffffffu)

/** \brief Offset for Ifx_PSI5_TSRB_Bits.CTS */
#define IFX_PSI5_TSRB_CTS_OFF (0u)

/** \brief Length for Ifx_PSI5_TSRB_Bits.ETB */
#define IFX_PSI5_TSRB_ETB_LEN (3u)

/** \brief Mask for Ifx_PSI5_TSRB_Bits.ETB */
#define IFX_PSI5_TSRB_ETB_MSK (0x7u)

/** \brief Offset for Ifx_PSI5_TSRB_Bits.ETB */
#define IFX_PSI5_TSRB_ETB_OFF (24u)

/** \brief Length for Ifx_PSI5_TSRB_Bits.TBS */
#define IFX_PSI5_TSRB_TBS_LEN (1u)

/** \brief Mask for Ifx_PSI5_TSRB_Bits.TBS */
#define IFX_PSI5_TSRB_TBS_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_TSRB_Bits.TBS */
#define IFX_PSI5_TSRB_TBS_OFF (27u)

/** \brief Length for Ifx_PSI5_TSRB_Bits.ACLR */
#define IFX_PSI5_TSRB_ACLR_LEN (1u)

/** \brief Mask for Ifx_PSI5_TSRB_Bits.ACLR */
#define IFX_PSI5_TSRB_ACLR_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_TSRB_Bits.ACLR */
#define IFX_PSI5_TSRB_ACLR_OFF (30u)

/** \brief Length for Ifx_PSI5_TSRB_Bits.CLR */
#define IFX_PSI5_TSRB_CLR_LEN (1u)

/** \brief Mask for Ifx_PSI5_TSRB_Bits.CLR */
#define IFX_PSI5_TSRB_CLR_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_TSRB_Bits.CLR */
#define IFX_PSI5_TSRB_CLR_OFF (31u)

/** \brief Length for Ifx_PSI5_TSRC_Bits.CTS */
#define IFX_PSI5_TSRC_CTS_LEN (24u)

/** \brief Mask for Ifx_PSI5_TSRC_Bits.CTS */
#define IFX_PSI5_TSRC_CTS_MSK (0xffffffu)

/** \brief Offset for Ifx_PSI5_TSRC_Bits.CTS */
#define IFX_PSI5_TSRC_CTS_OFF (0u)

/** \brief Length for Ifx_PSI5_TSRC_Bits.ETB */
#define IFX_PSI5_TSRC_ETB_LEN (3u)

/** \brief Mask for Ifx_PSI5_TSRC_Bits.ETB */
#define IFX_PSI5_TSRC_ETB_MSK (0x7u)

/** \brief Offset for Ifx_PSI5_TSRC_Bits.ETB */
#define IFX_PSI5_TSRC_ETB_OFF (24u)

/** \brief Length for Ifx_PSI5_TSRC_Bits.TBS */
#define IFX_PSI5_TSRC_TBS_LEN (1u)

/** \brief Mask for Ifx_PSI5_TSRC_Bits.TBS */
#define IFX_PSI5_TSRC_TBS_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_TSRC_Bits.TBS */
#define IFX_PSI5_TSRC_TBS_OFF (27u)

/** \brief Length for Ifx_PSI5_TSRC_Bits.ACLR */
#define IFX_PSI5_TSRC_ACLR_LEN (1u)

/** \brief Mask for Ifx_PSI5_TSRC_Bits.ACLR */
#define IFX_PSI5_TSRC_ACLR_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_TSRC_Bits.ACLR */
#define IFX_PSI5_TSRC_ACLR_OFF (30u)

/** \brief Length for Ifx_PSI5_TSRC_Bits.CLR */
#define IFX_PSI5_TSRC_CLR_LEN (1u)

/** \brief Mask for Ifx_PSI5_TSRC_Bits.CLR */
#define IFX_PSI5_TSRC_CLR_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_TSRC_Bits.CLR */
#define IFX_PSI5_TSRC_CLR_OFF (31u)

/** \brief Length for Ifx_PSI5_GCR_Bits.CRCI */
#define IFX_PSI5_GCR_CRCI_LEN (1u)

/** \brief Mask for Ifx_PSI5_GCR_Bits.CRCI */
#define IFX_PSI5_GCR_CRCI_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_GCR_Bits.CRCI */
#define IFX_PSI5_GCR_CRCI_OFF (0u)

/** \brief Length for Ifx_PSI5_GCR_Bits.NBI */
#define IFX_PSI5_GCR_NBI_LEN (1u)

/** \brief Mask for Ifx_PSI5_GCR_Bits.NBI */
#define IFX_PSI5_GCR_NBI_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_GCR_Bits.NBI */
#define IFX_PSI5_GCR_NBI_OFF (1u)

/** \brief Length for Ifx_PSI5_GCR_Bits.MEI */
#define IFX_PSI5_GCR_MEI_LEN (1u)

/** \brief Mask for Ifx_PSI5_GCR_Bits.MEI */
#define IFX_PSI5_GCR_MEI_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_GCR_Bits.MEI */
#define IFX_PSI5_GCR_MEI_OFF (2u)

/** \brief Length for Ifx_PSI5_GCR_Bits.NFI */
#define IFX_PSI5_GCR_NFI_LEN (1u)

/** \brief Mask for Ifx_PSI5_GCR_Bits.NFI */
#define IFX_PSI5_GCR_NFI_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_GCR_Bits.NFI */
#define IFX_PSI5_GCR_NFI_OFF (3u)

/** \brief Length for Ifx_PSI5_GCR_Bits.TEI */
#define IFX_PSI5_GCR_TEI_LEN (1u)

/** \brief Mask for Ifx_PSI5_GCR_Bits.TEI */
#define IFX_PSI5_GCR_TEI_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_GCR_Bits.TEI */
#define IFX_PSI5_GCR_TEI_OFF (4u)

/** \brief Length for Ifx_PSI5_GCR_Bits.ETC0 */
#define IFX_PSI5_GCR_ETC0_LEN (1u)

/** \brief Mask for Ifx_PSI5_GCR_Bits.ETC0 */
#define IFX_PSI5_GCR_ETC0_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_GCR_Bits.ETC0 */
#define IFX_PSI5_GCR_ETC0_OFF (8u)

/** \brief Length for Ifx_PSI5_GCR_Bits.ETC1 */
#define IFX_PSI5_GCR_ETC1_LEN (1u)

/** \brief Mask for Ifx_PSI5_GCR_Bits.ETC1 */
#define IFX_PSI5_GCR_ETC1_MSK (0x1u)

