HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxPsi5_bf.h
/** \brief Offset for Ifx_PSI5_CH_SORL_Bits.SD1 */
#define IFX_PSI5_CH_SORL_SD1_OFF (1u)

/** \brief Length for Ifx_PSI5_CH_SORL_Bits.SD2 */
#define IFX_PSI5_CH_SORL_SD2_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_SORL_Bits.SD2 */
#define IFX_PSI5_CH_SORL_SD2_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_SORL_Bits.SD2 */
#define IFX_PSI5_CH_SORL_SD2_OFF (2u)

/** \brief Length for Ifx_PSI5_CH_SORL_Bits.SD3 */
#define IFX_PSI5_CH_SORL_SD3_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_SORL_Bits.SD3 */
#define IFX_PSI5_CH_SORL_SD3_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_SORL_Bits.SD3 */
#define IFX_PSI5_CH_SORL_SD3_OFF (3u)

/** \brief Length for Ifx_PSI5_CH_SORL_Bits.SD4 */
#define IFX_PSI5_CH_SORL_SD4_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_SORL_Bits.SD4 */
#define IFX_PSI5_CH_SORL_SD4_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_SORL_Bits.SD4 */
#define IFX_PSI5_CH_SORL_SD4_OFF (4u)

/** \brief Length for Ifx_PSI5_CH_SORL_Bits.SD5 */
#define IFX_PSI5_CH_SORL_SD5_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_SORL_Bits.SD5 */
#define IFX_PSI5_CH_SORL_SD5_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_SORL_Bits.SD5 */
#define IFX_PSI5_CH_SORL_SD5_OFF (5u)

/** \brief Length for Ifx_PSI5_CH_SORL_Bits.SD6 */
#define IFX_PSI5_CH_SORL_SD6_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_SORL_Bits.SD6 */
#define IFX_PSI5_CH_SORL_SD6_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_SORL_Bits.SD6 */
#define IFX_PSI5_CH_SORL_SD6_OFF (6u)

/** \brief Length for Ifx_PSI5_CH_SORL_Bits.SD7 */
#define IFX_PSI5_CH_SORL_SD7_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_SORL_Bits.SD7 */
#define IFX_PSI5_CH_SORL_SD7_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_SORL_Bits.SD7 */
#define IFX_PSI5_CH_SORL_SD7_OFF (7u)

/** \brief Length for Ifx_PSI5_CH_SORL_Bits.SD8 */
#define IFX_PSI5_CH_SORL_SD8_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_SORL_Bits.SD8 */
#define IFX_PSI5_CH_SORL_SD8_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_SORL_Bits.SD8 */
#define IFX_PSI5_CH_SORL_SD8_OFF (8u)

/** \brief Length for Ifx_PSI5_CH_SORL_Bits.SD9 */
#define IFX_PSI5_CH_SORL_SD9_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_SORL_Bits.SD9 */
#define IFX_PSI5_CH_SORL_SD9_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_SORL_Bits.SD9 */
#define IFX_PSI5_CH_SORL_SD9_OFF (9u)

/** \brief Length for Ifx_PSI5_CH_SORL_Bits.SD10 */
#define IFX_PSI5_CH_SORL_SD10_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_SORL_Bits.SD10 */
#define IFX_PSI5_CH_SORL_SD10_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_SORL_Bits.SD10 */
#define IFX_PSI5_CH_SORL_SD10_OFF (10u)

/** \brief Length for Ifx_PSI5_CH_SORL_Bits.SD11 */
#define IFX_PSI5_CH_SORL_SD11_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_SORL_Bits.SD11 */
#define IFX_PSI5_CH_SORL_SD11_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_SORL_Bits.SD11 */
#define IFX_PSI5_CH_SORL_SD11_OFF (11u)

/** \brief Length for Ifx_PSI5_CH_SORL_Bits.SD12 */
#define IFX_PSI5_CH_SORL_SD12_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_SORL_Bits.SD12 */
#define IFX_PSI5_CH_SORL_SD12_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_SORL_Bits.SD12 */
#define IFX_PSI5_CH_SORL_SD12_OFF (12u)

/** \brief Length for Ifx_PSI5_CH_SORL_Bits.SD13 */
#define IFX_PSI5_CH_SORL_SD13_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_SORL_Bits.SD13 */
#define IFX_PSI5_CH_SORL_SD13_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_SORL_Bits.SD13 */
#define IFX_PSI5_CH_SORL_SD13_OFF (13u)

/** \brief Length for Ifx_PSI5_CH_SORL_Bits.SD14 */
#define IFX_PSI5_CH_SORL_SD14_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_SORL_Bits.SD14 */
#define IFX_PSI5_CH_SORL_SD14_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_SORL_Bits.SD14 */
#define IFX_PSI5_CH_SORL_SD14_OFF (14u)

/** \brief Length for Ifx_PSI5_CH_SORL_Bits.SD15 */
#define IFX_PSI5_CH_SORL_SD15_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_SORL_Bits.SD15 */
#define IFX_PSI5_CH_SORL_SD15_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_SORL_Bits.SD15 */
#define IFX_PSI5_CH_SORL_SD15_OFF (15u)

/** \brief Length for Ifx_PSI5_CH_SORL_Bits.SD16 */
#define IFX_PSI5_CH_SORL_SD16_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_SORL_Bits.SD16 */
#define IFX_PSI5_CH_SORL_SD16_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_SORL_Bits.SD16 */
#define IFX_PSI5_CH_SORL_SD16_OFF (16u)

/** \brief Length for Ifx_PSI5_CH_SORL_Bits.SD17 */
#define IFX_PSI5_CH_SORL_SD17_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_SORL_Bits.SD17 */
#define IFX_PSI5_CH_SORL_SD17_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_SORL_Bits.SD17 */
#define IFX_PSI5_CH_SORL_SD17_OFF (17u)

/** \brief Length for Ifx_PSI5_CH_SORL_Bits.SD18 */
#define IFX_PSI5_CH_SORL_SD18_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_SORL_Bits.SD18 */
#define IFX_PSI5_CH_SORL_SD18_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_SORL_Bits.SD18 */
#define IFX_PSI5_CH_SORL_SD18_OFF (18u)

/** \brief Length for Ifx_PSI5_CH_SORL_Bits.SD19 */
#define IFX_PSI5_CH_SORL_SD19_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_SORL_Bits.SD19 */
#define IFX_PSI5_CH_SORL_SD19_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_SORL_Bits.SD19 */
#define IFX_PSI5_CH_SORL_SD19_OFF (19u)

/** \brief Length for Ifx_PSI5_CH_SORL_Bits.SD20 */
#define IFX_PSI5_CH_SORL_SD20_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_SORL_Bits.SD20 */
#define IFX_PSI5_CH_SORL_SD20_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_SORL_Bits.SD20 */
#define IFX_PSI5_CH_SORL_SD20_OFF (20u)

/** \brief Length for Ifx_PSI5_CH_SORL_Bits.SD21 */
#define IFX_PSI5_CH_SORL_SD21_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_SORL_Bits.SD21 */
#define IFX_PSI5_CH_SORL_SD21_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_SORL_Bits.SD21 */
#define IFX_PSI5_CH_SORL_SD21_OFF (21u)

/** \brief Length for Ifx_PSI5_CH_SORL_Bits.SD22 */
#define IFX_PSI5_CH_SORL_SD22_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_SORL_Bits.SD22 */
#define IFX_PSI5_CH_SORL_SD22_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_SORL_Bits.SD22 */
#define IFX_PSI5_CH_SORL_SD22_OFF (22u)

/** \brief Length for Ifx_PSI5_CH_SORL_Bits.SD23 */
#define IFX_PSI5_CH_SORL_SD23_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_SORL_Bits.SD23 */
#define IFX_PSI5_CH_SORL_SD23_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_SORL_Bits.SD23 */
#define IFX_PSI5_CH_SORL_SD23_OFF (23u)

/** \brief Length for Ifx_PSI5_CH_SORL_Bits.SD24 */
#define IFX_PSI5_CH_SORL_SD24_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_SORL_Bits.SD24 */
#define IFX_PSI5_CH_SORL_SD24_MSK (0x1u)

