HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxPsi5_bf.h
/** \brief Length for Ifx_PSI5_INTOV_Bits.SDI */
#define IFX_PSI5_INTOV_SDI_LEN (1u)

/** \brief Mask for Ifx_PSI5_INTOV_Bits.SDI */
#define IFX_PSI5_INTOV_SDI_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_INTOV_Bits.SDI */
#define IFX_PSI5_INTOV_SDI_OFF (6u)

/** \brief Length for Ifx_PSI5_INTOV_Bits.FWI */
#define IFX_PSI5_INTOV_FWI_LEN (1u)

/** \brief Mask for Ifx_PSI5_INTOV_Bits.FWI */
#define IFX_PSI5_INTOV_FWI_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_INTOV_Bits.FWI */
#define IFX_PSI5_INTOV_FWI_OFF (7u)

/** \brief Length for Ifx_PSI5_INP_Bits.RSI */
#define IFX_PSI5_INP_RSI_LEN (4u)

/** \brief Mask for Ifx_PSI5_INP_Bits.RSI */
#define IFX_PSI5_INP_RSI_MSK (0xfu)

/** \brief Offset for Ifx_PSI5_INP_Bits.RSI */
#define IFX_PSI5_INP_RSI_OFF (0u)

/** \brief Length for Ifx_PSI5_INP_Bits.RDI */
#define IFX_PSI5_INP_RDI_LEN (4u)

/** \brief Mask for Ifx_PSI5_INP_Bits.RDI */
#define IFX_PSI5_INP_RDI_MSK (0xfu)

/** \brief Offset for Ifx_PSI5_INP_Bits.RDI */
#define IFX_PSI5_INP_RDI_OFF (4u)

/** \brief Length for Ifx_PSI5_INP_Bits.RBI */
#define IFX_PSI5_INP_RBI_LEN (4u)

/** \brief Mask for Ifx_PSI5_INP_Bits.RBI */
#define IFX_PSI5_INP_RBI_MSK (0xfu)

/** \brief Offset for Ifx_PSI5_INP_Bits.RBI */
#define IFX_PSI5_INP_RBI_OFF (8u)

/** \brief Length for Ifx_PSI5_INP_Bits.TDI */
#define IFX_PSI5_INP_TDI_LEN (4u)

/** \brief Mask for Ifx_PSI5_INP_Bits.TDI */
#define IFX_PSI5_INP_TDI_MSK (0xfu)

/** \brief Offset for Ifx_PSI5_INP_Bits.TDI */
#define IFX_PSI5_INP_TDI_OFF (12u)

/** \brief Length for Ifx_PSI5_INP_Bits.TBI */
#define IFX_PSI5_INP_TBI_LEN (4u)

/** \brief Mask for Ifx_PSI5_INP_Bits.TBI */
#define IFX_PSI5_INP_TBI_MSK (0xfu)

/** \brief Offset for Ifx_PSI5_INP_Bits.TBI */
#define IFX_PSI5_INP_TBI_OFF (16u)

/** \brief Length for Ifx_PSI5_INP_Bits.ERRI */
#define IFX_PSI5_INP_ERRI_LEN (4u)

/** \brief Mask for Ifx_PSI5_INP_Bits.ERRI */
#define IFX_PSI5_INP_ERRI_MSK (0xfu)

/** \brief Offset for Ifx_PSI5_INP_Bits.ERRI */
#define IFX_PSI5_INP_ERRI_OFF (20u)

/** \brief Length for Ifx_PSI5_INP_Bits.SDI */
#define IFX_PSI5_INP_SDI_LEN (4u)

/** \brief Mask for Ifx_PSI5_INP_Bits.SDI */
#define IFX_PSI5_INP_SDI_MSK (0xfu)

/** \brief Offset for Ifx_PSI5_INP_Bits.SDI */
#define IFX_PSI5_INP_SDI_OFF (24u)

/** \brief Length for Ifx_PSI5_INP_Bits.FWI */
#define IFX_PSI5_INP_FWI_LEN (4u)

/** \brief Mask for Ifx_PSI5_INP_Bits.FWI */
#define IFX_PSI5_INP_FWI_MSK (0xfu)

/** \brief Offset for Ifx_PSI5_INP_Bits.FWI */
#define IFX_PSI5_INP_FWI_OFF (28u)

/** \brief Length for Ifx_PSI5_INTSTATA_Bits.RSI */
#define IFX_PSI5_INTSTATA_RSI_LEN (1u)

/** \brief Mask for Ifx_PSI5_INTSTATA_Bits.RSI */
#define IFX_PSI5_INTSTATA_RSI_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_INTSTATA_Bits.RSI */
#define IFX_PSI5_INTSTATA_RSI_OFF (0u)

/** \brief Length for Ifx_PSI5_INTSTATA_Bits.RDI */
#define IFX_PSI5_INTSTATA_RDI_LEN (1u)

/** \brief Mask for Ifx_PSI5_INTSTATA_Bits.RDI */
#define IFX_PSI5_INTSTATA_RDI_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_INTSTATA_Bits.RDI */
#define IFX_PSI5_INTSTATA_RDI_OFF (1u)

/** \brief Length for Ifx_PSI5_INTSTATA_Bits.RBI */
#define IFX_PSI5_INTSTATA_RBI_LEN (1u)

/** \brief Mask for Ifx_PSI5_INTSTATA_Bits.RBI */
#define IFX_PSI5_INTSTATA_RBI_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_INTSTATA_Bits.RBI */
#define IFX_PSI5_INTSTATA_RBI_OFF (2u)

/** \brief Length for Ifx_PSI5_INTSTATA_Bits.TEI */
#define IFX_PSI5_INTSTATA_TEI_LEN (1u)

/** \brief Mask for Ifx_PSI5_INTSTATA_Bits.TEI */
#define IFX_PSI5_INTSTATA_TEI_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_INTSTATA_Bits.TEI */
#define IFX_PSI5_INTSTATA_TEI_OFF (3u)

/** \brief Length for Ifx_PSI5_INTSTATA_Bits.NBI */
#define IFX_PSI5_INTSTATA_NBI_LEN (1u)

/** \brief Mask for Ifx_PSI5_INTSTATA_Bits.NBI */
#define IFX_PSI5_INTSTATA_NBI_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_INTSTATA_Bits.NBI */
#define IFX_PSI5_INTSTATA_NBI_OFF (4u)

/** \brief Length for Ifx_PSI5_INTSTATA_Bits.MEI */
#define IFX_PSI5_INTSTATA_MEI_LEN (1u)

/** \brief Mask for Ifx_PSI5_INTSTATA_Bits.MEI */
#define IFX_PSI5_INTSTATA_MEI_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_INTSTATA_Bits.MEI */
#define IFX_PSI5_INTSTATA_MEI_OFF (5u)

/** \brief Length for Ifx_PSI5_INTSTATA_Bits.CRCI */
#define IFX_PSI5_INTSTATA_CRCI_LEN (1u)

/** \brief Mask for Ifx_PSI5_INTSTATA_Bits.CRCI */
#define IFX_PSI5_INTSTATA_CRCI_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_INTSTATA_Bits.CRCI */
#define IFX_PSI5_INTSTATA_CRCI_OFF (6u)

/** \brief Length for Ifx_PSI5_INTSTATA_Bits.FWI */
#define IFX_PSI5_INTSTATA_FWI_LEN (1u)

/** \brief Mask for Ifx_PSI5_INTSTATA_Bits.FWI */
#define IFX_PSI5_INTSTATA_FWI_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_INTSTATA_Bits.FWI */
#define IFX_PSI5_INTSTATA_FWI_OFF (7u)

/** \brief Length for Ifx_PSI5_INTSTATA_Bits.RUI */
#define IFX_PSI5_INTSTATA_RUI_LEN (1u)

/** \brief Mask for Ifx_PSI5_INTSTATA_Bits.RUI */
#define IFX_PSI5_INTSTATA_RUI_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_INTSTATA_Bits.RUI */
#define IFX_PSI5_INTSTATA_RUI_OFF (8u)

/** \brief Length for Ifx_PSI5_INTSTATA_Bits.RMI */
#define IFX_PSI5_INTSTATA_RMI_LEN (1u)

/** \brief Mask for Ifx_PSI5_INTSTATA_Bits.RMI */
#define IFX_PSI5_INTSTATA_RMI_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_INTSTATA_Bits.RMI */
#define IFX_PSI5_INTSTATA_RMI_OFF (9u)

/** \brief Length for Ifx_PSI5_INTSTATA_Bits.TPI */
#define IFX_PSI5_INTSTATA_TPI_LEN (1u)

/** \brief Mask for Ifx_PSI5_INTSTATA_Bits.TPI */
#define IFX_PSI5_INTSTATA_TPI_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_INTSTATA_Bits.TPI */
#define IFX_PSI5_INTSTATA_TPI_OFF (10u)

/** \brief Length for Ifx_PSI5_INTSTATA_Bits.TPOI */
#define IFX_PSI5_INTSTATA_TPOI_LEN (1u)

/** \brief Mask for Ifx_PSI5_INTSTATA_Bits.TPOI */
#define IFX_PSI5_INTSTATA_TPOI_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_INTSTATA_Bits.TPOI */
#define IFX_PSI5_INTSTATA_TPOI_OFF (11u)

/** \brief Length for Ifx_PSI5_INTSTATA_Bits.TSI */
#define IFX_PSI5_INTSTATA_TSI_LEN (1u)

/** \brief Mask for Ifx_PSI5_INTSTATA_Bits.TSI */
#define IFX_PSI5_INTSTATA_TSI_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_INTSTATA_Bits.TSI */
#define IFX_PSI5_INTSTATA_TSI_OFF (12u)

