HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxPsi5_bf.h
/** \brief Mask for Ifx_PSI5_INTENA_Bits.TEI */
#define IFX_PSI5_INTENA_TEI_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_INTENA_Bits.TEI */
#define IFX_PSI5_INTENA_TEI_OFF (3u)

/** \brief Length for Ifx_PSI5_INTENA_Bits.NBI */
#define IFX_PSI5_INTENA_NBI_LEN (1u)

/** \brief Mask for Ifx_PSI5_INTENA_Bits.NBI */
#define IFX_PSI5_INTENA_NBI_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_INTENA_Bits.NBI */
#define IFX_PSI5_INTENA_NBI_OFF (4u)

/** \brief Length for Ifx_PSI5_INTENA_Bits.MEI */
#define IFX_PSI5_INTENA_MEI_LEN (1u)

/** \brief Mask for Ifx_PSI5_INTENA_Bits.MEI */
#define IFX_PSI5_INTENA_MEI_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_INTENA_Bits.MEI */
#define IFX_PSI5_INTENA_MEI_OFF (5u)

/** \brief Length for Ifx_PSI5_INTENA_Bits.CRCI */
#define IFX_PSI5_INTENA_CRCI_LEN (1u)

/** \brief Mask for Ifx_PSI5_INTENA_Bits.CRCI */
#define IFX_PSI5_INTENA_CRCI_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_INTENA_Bits.CRCI */
#define IFX_PSI5_INTENA_CRCI_OFF (6u)

/** \brief Length for Ifx_PSI5_INTENA_Bits.FWI */
#define IFX_PSI5_INTENA_FWI_LEN (1u)

/** \brief Mask for Ifx_PSI5_INTENA_Bits.FWI */
#define IFX_PSI5_INTENA_FWI_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_INTENA_Bits.FWI */
#define IFX_PSI5_INTENA_FWI_OFF (7u)

/** \brief Length for Ifx_PSI5_INTENA_Bits.RUI */
#define IFX_PSI5_INTENA_RUI_LEN (1u)

/** \brief Mask for Ifx_PSI5_INTENA_Bits.RUI */
#define IFX_PSI5_INTENA_RUI_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_INTENA_Bits.RUI */
#define IFX_PSI5_INTENA_RUI_OFF (8u)

/** \brief Length for Ifx_PSI5_INTENA_Bits.RMI */
#define IFX_PSI5_INTENA_RMI_LEN (1u)

/** \brief Mask for Ifx_PSI5_INTENA_Bits.RMI */
#define IFX_PSI5_INTENA_RMI_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_INTENA_Bits.RMI */
#define IFX_PSI5_INTENA_RMI_OFF (9u)

/** \brief Length for Ifx_PSI5_INTENA_Bits.TPI */
#define IFX_PSI5_INTENA_TPI_LEN (1u)

/** \brief Mask for Ifx_PSI5_INTENA_Bits.TPI */
#define IFX_PSI5_INTENA_TPI_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_INTENA_Bits.TPI */
#define IFX_PSI5_INTENA_TPI_OFF (10u)

/** \brief Length for Ifx_PSI5_INTENA_Bits.TPOI */
#define IFX_PSI5_INTENA_TPOI_LEN (1u)

/** \brief Mask for Ifx_PSI5_INTENA_Bits.TPOI */
#define IFX_PSI5_INTENA_TPOI_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_INTENA_Bits.TPOI */
#define IFX_PSI5_INTENA_TPOI_OFF (11u)

/** \brief Length for Ifx_PSI5_INTENA_Bits.TSI */
#define IFX_PSI5_INTENA_TSI_LEN (1u)

/** \brief Mask for Ifx_PSI5_INTENA_Bits.TSI */
#define IFX_PSI5_INTENA_TSI_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_INTENA_Bits.TSI */
#define IFX_PSI5_INTENA_TSI_OFF (12u)

/** \brief Length for Ifx_PSI5_INTENA_Bits.TSOI */
#define IFX_PSI5_INTENA_TSOI_LEN (1u)

/** \brief Mask for Ifx_PSI5_INTENA_Bits.TSOI */
#define IFX_PSI5_INTENA_TSOI_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_INTENA_Bits.TSOI */
#define IFX_PSI5_INTENA_TSOI_OFF (13u)

/** \brief Length for Ifx_PSI5_INTENA_Bits.TOI */
#define IFX_PSI5_INTENA_TOI_LEN (1u)

/** \brief Mask for Ifx_PSI5_INTENA_Bits.TOI */
#define IFX_PSI5_INTENA_TOI_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_INTENA_Bits.TOI */
#define IFX_PSI5_INTENA_TOI_OFF (14u)

/** \brief Length for Ifx_PSI5_INTENA_Bits.TOOI */
#define IFX_PSI5_INTENA_TOOI_LEN (1u)

/** \brief Mask for Ifx_PSI5_INTENA_Bits.TOOI */
#define IFX_PSI5_INTENA_TOOI_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_INTENA_Bits.TOOI */
#define IFX_PSI5_INTENA_TOOI_OFF (15u)

/** \brief Length for Ifx_PSI5_INTENA_Bits.NFI */
#define IFX_PSI5_INTENA_NFI_LEN (1u)

/** \brief Mask for Ifx_PSI5_INTENA_Bits.NFI */
#define IFX_PSI5_INTENA_NFI_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_INTENA_Bits.NFI */
#define IFX_PSI5_INTENA_NFI_OFF (16u)

/** \brief Length for Ifx_PSI5_INTENB_Bits.WSI0 */
#define IFX_PSI5_INTENB_WSI0_LEN (1u)

/** \brief Mask for Ifx_PSI5_INTENB_Bits.WSI0 */
#define IFX_PSI5_INTENB_WSI0_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_INTENB_Bits.WSI0 */
#define IFX_PSI5_INTENB_WSI0_OFF (0u)

/** \brief Length for Ifx_PSI5_INTENB_Bits.WSI1 */
#define IFX_PSI5_INTENB_WSI1_LEN (1u)

/** \brief Mask for Ifx_PSI5_INTENB_Bits.WSI1 */
#define IFX_PSI5_INTENB_WSI1_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_INTENB_Bits.WSI1 */
#define IFX_PSI5_INTENB_WSI1_OFF (1u)

/** \brief Length for Ifx_PSI5_INTENB_Bits.WSI2 */
#define IFX_PSI5_INTENB_WSI2_LEN (1u)

/** \brief Mask for Ifx_PSI5_INTENB_Bits.WSI2 */
#define IFX_PSI5_INTENB_WSI2_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_INTENB_Bits.WSI2 */
#define IFX_PSI5_INTENB_WSI2_OFF (2u)

/** \brief Length for Ifx_PSI5_INTENB_Bits.WSI3 */
#define IFX_PSI5_INTENB_WSI3_LEN (1u)

/** \brief Mask for Ifx_PSI5_INTENB_Bits.WSI3 */
#define IFX_PSI5_INTENB_WSI3_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_INTENB_Bits.WSI3 */
#define IFX_PSI5_INTENB_WSI3_OFF (3u)

/** \brief Length for Ifx_PSI5_INTENB_Bits.WSI4 */
#define IFX_PSI5_INTENB_WSI4_LEN (1u)

/** \brief Mask for Ifx_PSI5_INTENB_Bits.WSI4 */
#define IFX_PSI5_INTENB_WSI4_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_INTENB_Bits.WSI4 */
#define IFX_PSI5_INTENB_WSI4_OFF (4u)

/** \brief Length for Ifx_PSI5_INTENB_Bits.WSI5 */
#define IFX_PSI5_INTENB_WSI5_LEN (1u)

/** \brief Mask for Ifx_PSI5_INTENB_Bits.WSI5 */
#define IFX_PSI5_INTENB_WSI5_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_INTENB_Bits.WSI5 */
#define IFX_PSI5_INTENB_WSI5_OFF (5u)

/** \brief Length for Ifx_PSI5_INTENB_Bits.SDI0 */
#define IFX_PSI5_INTENB_SDI0_LEN (1u)

/** \brief Mask for Ifx_PSI5_INTENB_Bits.SDI0 */
#define IFX_PSI5_INTENB_SDI0_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_INTENB_Bits.SDI0 */
#define IFX_PSI5_INTENB_SDI0_OFF (6u)

/** \brief Length for Ifx_PSI5_INTENB_Bits.SDI1 */
#define IFX_PSI5_INTENB_SDI1_LEN (1u)

/** \brief Mask for Ifx_PSI5_INTENB_Bits.SDI1 */
#define IFX_PSI5_INTENB_SDI1_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_INTENB_Bits.SDI1 */
#define IFX_PSI5_INTENB_SDI1_OFF (7u)

/** \brief Length for Ifx_PSI5_INTENB_Bits.SDI2 */
#define IFX_PSI5_INTENB_SDI2_LEN (1u)

/** \brief Mask for Ifx_PSI5_INTENB_Bits.SDI2 */
#define IFX_PSI5_INTENB_SDI2_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_INTENB_Bits.SDI2 */
#define IFX_PSI5_INTENB_SDI2_OFF (8u)

