HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxPsi5_bf.h
/** \brief Offset for Ifx_PSI5_NFISET_Bits.NFI29 */
#define IFX_PSI5_NFISET_NFI29_OFF (29u)

/** \brief Length for Ifx_PSI5_NFISET_Bits.NFI30 */
#define IFX_PSI5_NFISET_NFI30_LEN (1u)

/** \brief Mask for Ifx_PSI5_NFISET_Bits.NFI30 */
#define IFX_PSI5_NFISET_NFI30_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_NFISET_Bits.NFI30 */
#define IFX_PSI5_NFISET_NFI30_OFF (30u)

/** \brief Length for Ifx_PSI5_NFISET_Bits.NFI31 */
#define IFX_PSI5_NFISET_NFI31_LEN (1u)

/** \brief Mask for Ifx_PSI5_NFISET_Bits.NFI31 */
#define IFX_PSI5_NFISET_NFI31_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_NFISET_Bits.NFI31 */
#define IFX_PSI5_NFISET_NFI31_OFF (31u)

/** \brief Length for Ifx_PSI5_MEISET_Bits.MEI0 */
#define IFX_PSI5_MEISET_MEI0_LEN (1u)

/** \brief Mask for Ifx_PSI5_MEISET_Bits.MEI0 */
#define IFX_PSI5_MEISET_MEI0_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_MEISET_Bits.MEI0 */
#define IFX_PSI5_MEISET_MEI0_OFF (0u)

/** \brief Length for Ifx_PSI5_MEISET_Bits.MEI1 */
#define IFX_PSI5_MEISET_MEI1_LEN (1u)

/** \brief Mask for Ifx_PSI5_MEISET_Bits.MEI1 */
#define IFX_PSI5_MEISET_MEI1_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_MEISET_Bits.MEI1 */
#define IFX_PSI5_MEISET_MEI1_OFF (1u)

/** \brief Length for Ifx_PSI5_MEISET_Bits.MEI2 */
#define IFX_PSI5_MEISET_MEI2_LEN (1u)

/** \brief Mask for Ifx_PSI5_MEISET_Bits.MEI2 */
#define IFX_PSI5_MEISET_MEI2_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_MEISET_Bits.MEI2 */
#define IFX_PSI5_MEISET_MEI2_OFF (2u)

/** \brief Length for Ifx_PSI5_MEISET_Bits.MEI3 */
#define IFX_PSI5_MEISET_MEI3_LEN (1u)

/** \brief Mask for Ifx_PSI5_MEISET_Bits.MEI3 */
#define IFX_PSI5_MEISET_MEI3_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_MEISET_Bits.MEI3 */
#define IFX_PSI5_MEISET_MEI3_OFF (3u)

/** \brief Length for Ifx_PSI5_MEISET_Bits.MEI4 */
#define IFX_PSI5_MEISET_MEI4_LEN (1u)

/** \brief Mask for Ifx_PSI5_MEISET_Bits.MEI4 */
#define IFX_PSI5_MEISET_MEI4_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_MEISET_Bits.MEI4 */
#define IFX_PSI5_MEISET_MEI4_OFF (4u)

/** \brief Length for Ifx_PSI5_MEISET_Bits.MEI5 */
#define IFX_PSI5_MEISET_MEI5_LEN (1u)

/** \brief Mask for Ifx_PSI5_MEISET_Bits.MEI5 */
#define IFX_PSI5_MEISET_MEI5_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_MEISET_Bits.MEI5 */
#define IFX_PSI5_MEISET_MEI5_OFF (5u)

/** \brief Length for Ifx_PSI5_MEISET_Bits.MEI6 */
#define IFX_PSI5_MEISET_MEI6_LEN (1u)

/** \brief Mask for Ifx_PSI5_MEISET_Bits.MEI6 */
#define IFX_PSI5_MEISET_MEI6_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_MEISET_Bits.MEI6 */
#define IFX_PSI5_MEISET_MEI6_OFF (6u)

/** \brief Length for Ifx_PSI5_MEISET_Bits.MEI7 */
#define IFX_PSI5_MEISET_MEI7_LEN (1u)

/** \brief Mask for Ifx_PSI5_MEISET_Bits.MEI7 */
#define IFX_PSI5_MEISET_MEI7_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_MEISET_Bits.MEI7 */
#define IFX_PSI5_MEISET_MEI7_OFF (7u)

/** \brief Length for Ifx_PSI5_MEISET_Bits.MEI8 */
#define IFX_PSI5_MEISET_MEI8_LEN (1u)

/** \brief Mask for Ifx_PSI5_MEISET_Bits.MEI8 */
#define IFX_PSI5_MEISET_MEI8_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_MEISET_Bits.MEI8 */
#define IFX_PSI5_MEISET_MEI8_OFF (8u)

/** \brief Length for Ifx_PSI5_MEISET_Bits.MEI9 */
#define IFX_PSI5_MEISET_MEI9_LEN (1u)

/** \brief Mask for Ifx_PSI5_MEISET_Bits.MEI9 */
#define IFX_PSI5_MEISET_MEI9_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_MEISET_Bits.MEI9 */
#define IFX_PSI5_MEISET_MEI9_OFF (9u)

/** \brief Length for Ifx_PSI5_MEISET_Bits.MEI10 */
#define IFX_PSI5_MEISET_MEI10_LEN (1u)

/** \brief Mask for Ifx_PSI5_MEISET_Bits.MEI10 */
#define IFX_PSI5_MEISET_MEI10_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_MEISET_Bits.MEI10 */
#define IFX_PSI5_MEISET_MEI10_OFF (10u)

/** \brief Length for Ifx_PSI5_MEISET_Bits.MEI11 */
#define IFX_PSI5_MEISET_MEI11_LEN (1u)

/** \brief Mask for Ifx_PSI5_MEISET_Bits.MEI11 */
#define IFX_PSI5_MEISET_MEI11_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_MEISET_Bits.MEI11 */
#define IFX_PSI5_MEISET_MEI11_OFF (11u)

/** \brief Length for Ifx_PSI5_MEISET_Bits.MEI12 */
#define IFX_PSI5_MEISET_MEI12_LEN (1u)

/** \brief Mask for Ifx_PSI5_MEISET_Bits.MEI12 */
#define IFX_PSI5_MEISET_MEI12_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_MEISET_Bits.MEI12 */
#define IFX_PSI5_MEISET_MEI12_OFF (12u)

/** \brief Length for Ifx_PSI5_MEISET_Bits.MEI13 */
#define IFX_PSI5_MEISET_MEI13_LEN (1u)

/** \brief Mask for Ifx_PSI5_MEISET_Bits.MEI13 */
#define IFX_PSI5_MEISET_MEI13_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_MEISET_Bits.MEI13 */
#define IFX_PSI5_MEISET_MEI13_OFF (13u)

/** \brief Length for Ifx_PSI5_MEISET_Bits.MEI14 */
#define IFX_PSI5_MEISET_MEI14_LEN (1u)

/** \brief Mask for Ifx_PSI5_MEISET_Bits.MEI14 */
#define IFX_PSI5_MEISET_MEI14_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_MEISET_Bits.MEI14 */
#define IFX_PSI5_MEISET_MEI14_OFF (14u)

/** \brief Length for Ifx_PSI5_MEISET_Bits.MEI15 */
#define IFX_PSI5_MEISET_MEI15_LEN (1u)

/** \brief Mask for Ifx_PSI5_MEISET_Bits.MEI15 */
#define IFX_PSI5_MEISET_MEI15_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_MEISET_Bits.MEI15 */
#define IFX_PSI5_MEISET_MEI15_OFF (15u)

/** \brief Length for Ifx_PSI5_MEISET_Bits.MEI16 */
#define IFX_PSI5_MEISET_MEI16_LEN (1u)

/** \brief Mask for Ifx_PSI5_MEISET_Bits.MEI16 */
#define IFX_PSI5_MEISET_MEI16_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_MEISET_Bits.MEI16 */
#define IFX_PSI5_MEISET_MEI16_OFF (16u)

/** \brief Length for Ifx_PSI5_MEISET_Bits.MEI17 */
#define IFX_PSI5_MEISET_MEI17_LEN (1u)

/** \brief Mask for Ifx_PSI5_MEISET_Bits.MEI17 */
#define IFX_PSI5_MEISET_MEI17_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_MEISET_Bits.MEI17 */
#define IFX_PSI5_MEISET_MEI17_OFF (17u)

/** \brief Length for Ifx_PSI5_MEISET_Bits.MEI18 */
#define IFX_PSI5_MEISET_MEI18_LEN (1u)

/** \brief Mask for Ifx_PSI5_MEISET_Bits.MEI18 */
#define IFX_PSI5_MEISET_MEI18_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_MEISET_Bits.MEI18 */
#define IFX_PSI5_MEISET_MEI18_OFF (18u)

/** \brief Length for Ifx_PSI5_MEISET_Bits.MEI19 */
#define IFX_PSI5_MEISET_MEI19_LEN (1u)

/** \brief Mask for Ifx_PSI5_MEISET_Bits.MEI19 */
#define IFX_PSI5_MEISET_MEI19_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_MEISET_Bits.MEI19 */
#define IFX_PSI5_MEISET_MEI19_OFF (19u)

/** \brief Length for Ifx_PSI5_MEISET_Bits.MEI20 */
#define IFX_PSI5_MEISET_MEI20_LEN (1u)

