HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxPsi5_bf.h
/** \brief Offset for Ifx_PSI5_RSICLR_Bits.RSI10 */
#define IFX_PSI5_RSICLR_RSI10_OFF (10u)

/** \brief Length for Ifx_PSI5_RSICLR_Bits.RSI11 */
#define IFX_PSI5_RSICLR_RSI11_LEN (1u)

/** \brief Mask for Ifx_PSI5_RSICLR_Bits.RSI11 */
#define IFX_PSI5_RSICLR_RSI11_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RSICLR_Bits.RSI11 */
#define IFX_PSI5_RSICLR_RSI11_OFF (11u)

/** \brief Length for Ifx_PSI5_RSICLR_Bits.RSI12 */
#define IFX_PSI5_RSICLR_RSI12_LEN (1u)

/** \brief Mask for Ifx_PSI5_RSICLR_Bits.RSI12 */
#define IFX_PSI5_RSICLR_RSI12_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RSICLR_Bits.RSI12 */
#define IFX_PSI5_RSICLR_RSI12_OFF (12u)

/** \brief Length for Ifx_PSI5_RSICLR_Bits.RSI13 */
#define IFX_PSI5_RSICLR_RSI13_LEN (1u)

/** \brief Mask for Ifx_PSI5_RSICLR_Bits.RSI13 */
#define IFX_PSI5_RSICLR_RSI13_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RSICLR_Bits.RSI13 */
#define IFX_PSI5_RSICLR_RSI13_OFF (13u)

/** \brief Length for Ifx_PSI5_RSICLR_Bits.RSI14 */
#define IFX_PSI5_RSICLR_RSI14_LEN (1u)

/** \brief Mask for Ifx_PSI5_RSICLR_Bits.RSI14 */
#define IFX_PSI5_RSICLR_RSI14_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RSICLR_Bits.RSI14 */
#define IFX_PSI5_RSICLR_RSI14_OFF (14u)

/** \brief Length for Ifx_PSI5_RSICLR_Bits.RSI15 */
#define IFX_PSI5_RSICLR_RSI15_LEN (1u)

/** \brief Mask for Ifx_PSI5_RSICLR_Bits.RSI15 */
#define IFX_PSI5_RSICLR_RSI15_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RSICLR_Bits.RSI15 */
#define IFX_PSI5_RSICLR_RSI15_OFF (15u)

/** \brief Length for Ifx_PSI5_RSICLR_Bits.RSI16 */
#define IFX_PSI5_RSICLR_RSI16_LEN (1u)

/** \brief Mask for Ifx_PSI5_RSICLR_Bits.RSI16 */
#define IFX_PSI5_RSICLR_RSI16_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RSICLR_Bits.RSI16 */
#define IFX_PSI5_RSICLR_RSI16_OFF (16u)

/** \brief Length for Ifx_PSI5_RSICLR_Bits.RSI17 */
#define IFX_PSI5_RSICLR_RSI17_LEN (1u)

/** \brief Mask for Ifx_PSI5_RSICLR_Bits.RSI17 */
#define IFX_PSI5_RSICLR_RSI17_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RSICLR_Bits.RSI17 */
#define IFX_PSI5_RSICLR_RSI17_OFF (17u)

/** \brief Length for Ifx_PSI5_RSICLR_Bits.RSI18 */
#define IFX_PSI5_RSICLR_RSI18_LEN (1u)

/** \brief Mask for Ifx_PSI5_RSICLR_Bits.RSI18 */
#define IFX_PSI5_RSICLR_RSI18_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RSICLR_Bits.RSI18 */
#define IFX_PSI5_RSICLR_RSI18_OFF (18u)

/** \brief Length for Ifx_PSI5_RSICLR_Bits.RSI19 */
#define IFX_PSI5_RSICLR_RSI19_LEN (1u)

/** \brief Mask for Ifx_PSI5_RSICLR_Bits.RSI19 */
#define IFX_PSI5_RSICLR_RSI19_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RSICLR_Bits.RSI19 */
#define IFX_PSI5_RSICLR_RSI19_OFF (19u)

/** \brief Length for Ifx_PSI5_RSICLR_Bits.RSI20 */
#define IFX_PSI5_RSICLR_RSI20_LEN (1u)

/** \brief Mask for Ifx_PSI5_RSICLR_Bits.RSI20 */
#define IFX_PSI5_RSICLR_RSI20_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RSICLR_Bits.RSI20 */
#define IFX_PSI5_RSICLR_RSI20_OFF (20u)

/** \brief Length for Ifx_PSI5_RSICLR_Bits.RSI21 */
#define IFX_PSI5_RSICLR_RSI21_LEN (1u)

/** \brief Mask for Ifx_PSI5_RSICLR_Bits.RSI21 */
#define IFX_PSI5_RSICLR_RSI21_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RSICLR_Bits.RSI21 */
#define IFX_PSI5_RSICLR_RSI21_OFF (21u)

/** \brief Length for Ifx_PSI5_RSICLR_Bits.RSI22 */
#define IFX_PSI5_RSICLR_RSI22_LEN (1u)

/** \brief Mask for Ifx_PSI5_RSICLR_Bits.RSI22 */
#define IFX_PSI5_RSICLR_RSI22_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RSICLR_Bits.RSI22 */
#define IFX_PSI5_RSICLR_RSI22_OFF (22u)

/** \brief Length for Ifx_PSI5_RSICLR_Bits.RSI23 */
#define IFX_PSI5_RSICLR_RSI23_LEN (1u)

/** \brief Mask for Ifx_PSI5_RSICLR_Bits.RSI23 */
#define IFX_PSI5_RSICLR_RSI23_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RSICLR_Bits.RSI23 */
#define IFX_PSI5_RSICLR_RSI23_OFF (23u)

/** \brief Length for Ifx_PSI5_RSICLR_Bits.RSI24 */
#define IFX_PSI5_RSICLR_RSI24_LEN (1u)

/** \brief Mask for Ifx_PSI5_RSICLR_Bits.RSI24 */
#define IFX_PSI5_RSICLR_RSI24_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RSICLR_Bits.RSI24 */
#define IFX_PSI5_RSICLR_RSI24_OFF (24u)

/** \brief Length for Ifx_PSI5_RSICLR_Bits.RSI25 */
#define IFX_PSI5_RSICLR_RSI25_LEN (1u)

/** \brief Mask for Ifx_PSI5_RSICLR_Bits.RSI25 */
#define IFX_PSI5_RSICLR_RSI25_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RSICLR_Bits.RSI25 */
#define IFX_PSI5_RSICLR_RSI25_OFF (25u)

/** \brief Length for Ifx_PSI5_RSICLR_Bits.RSI26 */
#define IFX_PSI5_RSICLR_RSI26_LEN (1u)

/** \brief Mask for Ifx_PSI5_RSICLR_Bits.RSI26 */
#define IFX_PSI5_RSICLR_RSI26_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RSICLR_Bits.RSI26 */
#define IFX_PSI5_RSICLR_RSI26_OFF (26u)

/** \brief Length for Ifx_PSI5_RSICLR_Bits.RSI27 */
#define IFX_PSI5_RSICLR_RSI27_LEN (1u)

/** \brief Mask for Ifx_PSI5_RSICLR_Bits.RSI27 */
#define IFX_PSI5_RSICLR_RSI27_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RSICLR_Bits.RSI27 */
#define IFX_PSI5_RSICLR_RSI27_OFF (27u)

/** \brief Length for Ifx_PSI5_RSICLR_Bits.RSI28 */
#define IFX_PSI5_RSICLR_RSI28_LEN (1u)

/** \brief Mask for Ifx_PSI5_RSICLR_Bits.RSI28 */
#define IFX_PSI5_RSICLR_RSI28_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RSICLR_Bits.RSI28 */
#define IFX_PSI5_RSICLR_RSI28_OFF (28u)

/** \brief Length for Ifx_PSI5_RSICLR_Bits.RSI29 */
#define IFX_PSI5_RSICLR_RSI29_LEN (1u)

/** \brief Mask for Ifx_PSI5_RSICLR_Bits.RSI29 */
#define IFX_PSI5_RSICLR_RSI29_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RSICLR_Bits.RSI29 */
#define IFX_PSI5_RSICLR_RSI29_OFF (29u)

/** \brief Length for Ifx_PSI5_RSICLR_Bits.RSI30 */
#define IFX_PSI5_RSICLR_RSI30_LEN (1u)

/** \brief Mask for Ifx_PSI5_RSICLR_Bits.RSI30 */
#define IFX_PSI5_RSICLR_RSI30_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RSICLR_Bits.RSI30 */
#define IFX_PSI5_RSICLR_RSI30_OFF (30u)

/** \brief Length for Ifx_PSI5_RSICLR_Bits.RSI31 */
#define IFX_PSI5_RSICLR_RSI31_LEN (1u)

/** \brief Mask for Ifx_PSI5_RSICLR_Bits.RSI31 */
#define IFX_PSI5_RSICLR_RSI31_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RSICLR_Bits.RSI31 */
#define IFX_PSI5_RSICLR_RSI31_OFF (31u)

/** \brief Length for Ifx_PSI5_RMICLR_Bits.RMI0 */
#define IFX_PSI5_RMICLR_RMI0_LEN (1u)

