HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxPsi5_bf.h
/** \brief Length for Ifx_PSI5_CRCICLR_Bits.CRCI19 */
#define IFX_PSI5_CRCICLR_CRCI19_LEN (1u)

/** \brief Mask for Ifx_PSI5_CRCICLR_Bits.CRCI19 */
#define IFX_PSI5_CRCICLR_CRCI19_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CRCICLR_Bits.CRCI19 */
#define IFX_PSI5_CRCICLR_CRCI19_OFF (19u)

/** \brief Length for Ifx_PSI5_CRCICLR_Bits.CRCI20 */
#define IFX_PSI5_CRCICLR_CRCI20_LEN (1u)

/** \brief Mask for Ifx_PSI5_CRCICLR_Bits.CRCI20 */
#define IFX_PSI5_CRCICLR_CRCI20_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CRCICLR_Bits.CRCI20 */
#define IFX_PSI5_CRCICLR_CRCI20_OFF (20u)

/** \brief Length for Ifx_PSI5_CRCICLR_Bits.CRCI21 */
#define IFX_PSI5_CRCICLR_CRCI21_LEN (1u)

/** \brief Mask for Ifx_PSI5_CRCICLR_Bits.CRCI21 */
#define IFX_PSI5_CRCICLR_CRCI21_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CRCICLR_Bits.CRCI21 */
#define IFX_PSI5_CRCICLR_CRCI21_OFF (21u)

/** \brief Length for Ifx_PSI5_CRCICLR_Bits.CRCI22 */
#define IFX_PSI5_CRCICLR_CRCI22_LEN (1u)

/** \brief Mask for Ifx_PSI5_CRCICLR_Bits.CRCI22 */
#define IFX_PSI5_CRCICLR_CRCI22_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CRCICLR_Bits.CRCI22 */
#define IFX_PSI5_CRCICLR_CRCI22_OFF (22u)

/** \brief Length for Ifx_PSI5_CRCICLR_Bits.CRCI23 */
#define IFX_PSI5_CRCICLR_CRCI23_LEN (1u)

/** \brief Mask for Ifx_PSI5_CRCICLR_Bits.CRCI23 */
#define IFX_PSI5_CRCICLR_CRCI23_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CRCICLR_Bits.CRCI23 */
#define IFX_PSI5_CRCICLR_CRCI23_OFF (23u)

/** \brief Length for Ifx_PSI5_CRCICLR_Bits.CRCI24 */
#define IFX_PSI5_CRCICLR_CRCI24_LEN (1u)

/** \brief Mask for Ifx_PSI5_CRCICLR_Bits.CRCI24 */
#define IFX_PSI5_CRCICLR_CRCI24_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CRCICLR_Bits.CRCI24 */
#define IFX_PSI5_CRCICLR_CRCI24_OFF (24u)

/** \brief Length for Ifx_PSI5_CRCICLR_Bits.CRCI25 */
#define IFX_PSI5_CRCICLR_CRCI25_LEN (1u)

/** \brief Mask for Ifx_PSI5_CRCICLR_Bits.CRCI25 */
#define IFX_PSI5_CRCICLR_CRCI25_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CRCICLR_Bits.CRCI25 */
#define IFX_PSI5_CRCICLR_CRCI25_OFF (25u)

/** \brief Length for Ifx_PSI5_CRCICLR_Bits.CRCI26 */
#define IFX_PSI5_CRCICLR_CRCI26_LEN (1u)

/** \brief Mask for Ifx_PSI5_CRCICLR_Bits.CRCI26 */
#define IFX_PSI5_CRCICLR_CRCI26_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CRCICLR_Bits.CRCI26 */
#define IFX_PSI5_CRCICLR_CRCI26_OFF (26u)

/** \brief Length for Ifx_PSI5_CRCICLR_Bits.CRCI27 */
#define IFX_PSI5_CRCICLR_CRCI27_LEN (1u)

/** \brief Mask for Ifx_PSI5_CRCICLR_Bits.CRCI27 */
#define IFX_PSI5_CRCICLR_CRCI27_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CRCICLR_Bits.CRCI27 */
#define IFX_PSI5_CRCICLR_CRCI27_OFF (27u)

/** \brief Length for Ifx_PSI5_CRCICLR_Bits.CRCI28 */
#define IFX_PSI5_CRCICLR_CRCI28_LEN (1u)

/** \brief Mask for Ifx_PSI5_CRCICLR_Bits.CRCI28 */
#define IFX_PSI5_CRCICLR_CRCI28_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CRCICLR_Bits.CRCI28 */
#define IFX_PSI5_CRCICLR_CRCI28_OFF (28u)

/** \brief Length for Ifx_PSI5_CRCICLR_Bits.CRCI29 */
#define IFX_PSI5_CRCICLR_CRCI29_LEN (1u)

/** \brief Mask for Ifx_PSI5_CRCICLR_Bits.CRCI29 */
#define IFX_PSI5_CRCICLR_CRCI29_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CRCICLR_Bits.CRCI29 */
#define IFX_PSI5_CRCICLR_CRCI29_OFF (29u)

/** \brief Length for Ifx_PSI5_CRCICLR_Bits.CRCI30 */
#define IFX_PSI5_CRCICLR_CRCI30_LEN (1u)

/** \brief Mask for Ifx_PSI5_CRCICLR_Bits.CRCI30 */
#define IFX_PSI5_CRCICLR_CRCI30_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CRCICLR_Bits.CRCI30 */
#define IFX_PSI5_CRCICLR_CRCI30_OFF (30u)

/** \brief Length for Ifx_PSI5_CRCICLR_Bits.CRCI31 */
#define IFX_PSI5_CRCICLR_CRCI31_LEN (1u)

/** \brief Mask for Ifx_PSI5_CRCICLR_Bits.CRCI31 */
#define IFX_PSI5_CRCICLR_CRCI31_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CRCICLR_Bits.CRCI31 */
#define IFX_PSI5_CRCICLR_CRCI31_OFF (31u)

/** \brief Length for Ifx_PSI5_RDICLR_Bits.RDI0 */
#define IFX_PSI5_RDICLR_RDI0_LEN (1u)

/** \brief Mask for Ifx_PSI5_RDICLR_Bits.RDI0 */
#define IFX_PSI5_RDICLR_RDI0_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RDICLR_Bits.RDI0 */
#define IFX_PSI5_RDICLR_RDI0_OFF (0u)

/** \brief Length for Ifx_PSI5_RDICLR_Bits.RDI1 */
#define IFX_PSI5_RDICLR_RDI1_LEN (1u)

/** \brief Mask for Ifx_PSI5_RDICLR_Bits.RDI1 */
#define IFX_PSI5_RDICLR_RDI1_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RDICLR_Bits.RDI1 */
#define IFX_PSI5_RDICLR_RDI1_OFF (1u)

/** \brief Length for Ifx_PSI5_RDICLR_Bits.RDI2 */
#define IFX_PSI5_RDICLR_RDI2_LEN (1u)

/** \brief Mask for Ifx_PSI5_RDICLR_Bits.RDI2 */
#define IFX_PSI5_RDICLR_RDI2_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RDICLR_Bits.RDI2 */
#define IFX_PSI5_RDICLR_RDI2_OFF (2u)

/** \brief Length for Ifx_PSI5_RDICLR_Bits.RDI3 */
#define IFX_PSI5_RDICLR_RDI3_LEN (1u)

/** \brief Mask for Ifx_PSI5_RDICLR_Bits.RDI3 */
#define IFX_PSI5_RDICLR_RDI3_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RDICLR_Bits.RDI3 */
#define IFX_PSI5_RDICLR_RDI3_OFF (3u)

/** \brief Length for Ifx_PSI5_RDICLR_Bits.RDI4 */
#define IFX_PSI5_RDICLR_RDI4_LEN (1u)

/** \brief Mask for Ifx_PSI5_RDICLR_Bits.RDI4 */
#define IFX_PSI5_RDICLR_RDI4_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RDICLR_Bits.RDI4 */
#define IFX_PSI5_RDICLR_RDI4_OFF (4u)

/** \brief Length for Ifx_PSI5_RDICLR_Bits.RDI5 */
#define IFX_PSI5_RDICLR_RDI5_LEN (1u)

/** \brief Mask for Ifx_PSI5_RDICLR_Bits.RDI5 */
#define IFX_PSI5_RDICLR_RDI5_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RDICLR_Bits.RDI5 */
#define IFX_PSI5_RDICLR_RDI5_OFF (5u)

/** \brief Length for Ifx_PSI5_RDICLR_Bits.RDI6 */
#define IFX_PSI5_RDICLR_RDI6_LEN (1u)

/** \brief Mask for Ifx_PSI5_RDICLR_Bits.RDI6 */
#define IFX_PSI5_RDICLR_RDI6_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RDICLR_Bits.RDI6 */
#define IFX_PSI5_RDICLR_RDI6_OFF (6u)

/** \brief Length for Ifx_PSI5_RDICLR_Bits.RDI7 */
#define IFX_PSI5_RDICLR_RDI7_LEN (1u)

/** \brief Mask for Ifx_PSI5_RDICLR_Bits.RDI7 */
#define IFX_PSI5_RDICLR_RDI7_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RDICLR_Bits.RDI7 */
#define IFX_PSI5_RDICLR_RDI7_OFF (7u)

/** \brief Length for Ifx_PSI5_RDICLR_Bits.RDI8 */
#define IFX_PSI5_RDICLR_RDI8_LEN (1u)

/** \brief Mask for Ifx_PSI5_RDICLR_Bits.RDI8 */
#define IFX_PSI5_RDICLR_RDI8_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RDICLR_Bits.RDI8 */
#define IFX_PSI5_RDICLR_RDI8_OFF (8u)

/** \brief Length for Ifx_PSI5_RDICLR_Bits.RDI9 */
#define IFX_PSI5_RDICLR_RDI9_LEN (1u)

/** \brief Mask for Ifx_PSI5_RDICLR_Bits.RDI9 */
#define IFX_PSI5_RDICLR_RDI9_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RDICLR_Bits.RDI9 */
#define IFX_PSI5_RDICLR_RDI9_OFF (9u)

/** \brief Length for Ifx_PSI5_RDICLR_Bits.RDI10 */
#define IFX_PSI5_RDICLR_RDI10_LEN (1u)

/** \brief Mask for Ifx_PSI5_RDICLR_Bits.RDI10 */
#define IFX_PSI5_RDICLR_RDI10_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RDICLR_Bits.RDI10 */
#define IFX_PSI5_RDICLR_RDI10_OFF (10u)

/** \brief Length for Ifx_PSI5_RDICLR_Bits.RDI11 */
#define IFX_PSI5_RDICLR_RDI11_LEN (1u)

/** \brief Mask for Ifx_PSI5_RDICLR_Bits.RDI11 */
#define IFX_PSI5_RDICLR_RDI11_MSK (0x1u)

