HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxPsi5_bf.h
/** \brief Mask for Ifx_PSI5_MEICLR_Bits.MEI17 */
#define IFX_PSI5_MEICLR_MEI17_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_MEICLR_Bits.MEI17 */
#define IFX_PSI5_MEICLR_MEI17_OFF (17u)

/** \brief Length for Ifx_PSI5_MEICLR_Bits.MEI18 */
#define IFX_PSI5_MEICLR_MEI18_LEN (1u)

/** \brief Mask for Ifx_PSI5_MEICLR_Bits.MEI18 */
#define IFX_PSI5_MEICLR_MEI18_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_MEICLR_Bits.MEI18 */
#define IFX_PSI5_MEICLR_MEI18_OFF (18u)

/** \brief Length for Ifx_PSI5_MEICLR_Bits.MEI19 */
#define IFX_PSI5_MEICLR_MEI19_LEN (1u)

/** \brief Mask for Ifx_PSI5_MEICLR_Bits.MEI19 */
#define IFX_PSI5_MEICLR_MEI19_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_MEICLR_Bits.MEI19 */
#define IFX_PSI5_MEICLR_MEI19_OFF (19u)

/** \brief Length for Ifx_PSI5_MEICLR_Bits.MEI20 */
#define IFX_PSI5_MEICLR_MEI20_LEN (1u)

/** \brief Mask for Ifx_PSI5_MEICLR_Bits.MEI20 */
#define IFX_PSI5_MEICLR_MEI20_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_MEICLR_Bits.MEI20 */
#define IFX_PSI5_MEICLR_MEI20_OFF (20u)

/** \brief Length for Ifx_PSI5_MEICLR_Bits.MEI21 */
#define IFX_PSI5_MEICLR_MEI21_LEN (1u)

/** \brief Mask for Ifx_PSI5_MEICLR_Bits.MEI21 */
#define IFX_PSI5_MEICLR_MEI21_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_MEICLR_Bits.MEI21 */
#define IFX_PSI5_MEICLR_MEI21_OFF (21u)

/** \brief Length for Ifx_PSI5_MEICLR_Bits.MEI22 */
#define IFX_PSI5_MEICLR_MEI22_LEN (1u)

/** \brief Mask for Ifx_PSI5_MEICLR_Bits.MEI22 */
#define IFX_PSI5_MEICLR_MEI22_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_MEICLR_Bits.MEI22 */
#define IFX_PSI5_MEICLR_MEI22_OFF (22u)

/** \brief Length for Ifx_PSI5_MEICLR_Bits.MEI23 */
#define IFX_PSI5_MEICLR_MEI23_LEN (1u)

/** \brief Mask for Ifx_PSI5_MEICLR_Bits.MEI23 */
#define IFX_PSI5_MEICLR_MEI23_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_MEICLR_Bits.MEI23 */
#define IFX_PSI5_MEICLR_MEI23_OFF (23u)

/** \brief Length for Ifx_PSI5_MEICLR_Bits.MEI24 */
#define IFX_PSI5_MEICLR_MEI24_LEN (1u)

/** \brief Mask for Ifx_PSI5_MEICLR_Bits.MEI24 */
#define IFX_PSI5_MEICLR_MEI24_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_MEICLR_Bits.MEI24 */
#define IFX_PSI5_MEICLR_MEI24_OFF (24u)

/** \brief Length for Ifx_PSI5_MEICLR_Bits.MEI25 */
#define IFX_PSI5_MEICLR_MEI25_LEN (1u)

/** \brief Mask for Ifx_PSI5_MEICLR_Bits.MEI25 */
#define IFX_PSI5_MEICLR_MEI25_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_MEICLR_Bits.MEI25 */
#define IFX_PSI5_MEICLR_MEI25_OFF (25u)

/** \brief Length for Ifx_PSI5_MEICLR_Bits.MEI26 */
#define IFX_PSI5_MEICLR_MEI26_LEN (1u)

/** \brief Mask for Ifx_PSI5_MEICLR_Bits.MEI26 */
#define IFX_PSI5_MEICLR_MEI26_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_MEICLR_Bits.MEI26 */
#define IFX_PSI5_MEICLR_MEI26_OFF (26u)

/** \brief Length for Ifx_PSI5_MEICLR_Bits.MEI27 */
#define IFX_PSI5_MEICLR_MEI27_LEN (1u)

/** \brief Mask for Ifx_PSI5_MEICLR_Bits.MEI27 */
#define IFX_PSI5_MEICLR_MEI27_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_MEICLR_Bits.MEI27 */
#define IFX_PSI5_MEICLR_MEI27_OFF (27u)

/** \brief Length for Ifx_PSI5_MEICLR_Bits.MEI28 */
#define IFX_PSI5_MEICLR_MEI28_LEN (1u)

/** \brief Mask for Ifx_PSI5_MEICLR_Bits.MEI28 */
#define IFX_PSI5_MEICLR_MEI28_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_MEICLR_Bits.MEI28 */
#define IFX_PSI5_MEICLR_MEI28_OFF (28u)

/** \brief Length for Ifx_PSI5_MEICLR_Bits.MEI29 */
#define IFX_PSI5_MEICLR_MEI29_LEN (1u)

/** \brief Mask for Ifx_PSI5_MEICLR_Bits.MEI29 */
#define IFX_PSI5_MEICLR_MEI29_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_MEICLR_Bits.MEI29 */
#define IFX_PSI5_MEICLR_MEI29_OFF (29u)

/** \brief Length for Ifx_PSI5_MEICLR_Bits.MEI30 */
#define IFX_PSI5_MEICLR_MEI30_LEN (1u)

/** \brief Mask for Ifx_PSI5_MEICLR_Bits.MEI30 */
#define IFX_PSI5_MEICLR_MEI30_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_MEICLR_Bits.MEI30 */
#define IFX_PSI5_MEICLR_MEI30_OFF (30u)

/** \brief Length for Ifx_PSI5_MEICLR_Bits.MEI31 */
#define IFX_PSI5_MEICLR_MEI31_LEN (1u)

/** \brief Mask for Ifx_PSI5_MEICLR_Bits.MEI31 */
#define IFX_PSI5_MEICLR_MEI31_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_MEICLR_Bits.MEI31 */
#define IFX_PSI5_MEICLR_MEI31_OFF (31u)

/** \brief Length for Ifx_PSI5_RDM_L_Bits.CRCI */
#define IFX_PSI5_RDM_L_CRCI_LEN (1u)

/** \brief Mask for Ifx_PSI5_RDM_L_Bits.CRCI */
#define IFX_PSI5_RDM_L_CRCI_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RDM_L_Bits.CRCI */
#define IFX_PSI5_RDM_L_CRCI_OFF (0u)

/** \brief Length for Ifx_PSI5_RDM_L_Bits.CRC */
#define IFX_PSI5_RDM_L_CRC_LEN (3u)

/** \brief Mask for Ifx_PSI5_RDM_L_Bits.CRC */
#define IFX_PSI5_RDM_L_CRC_MSK (0x7u)

/** \brief Offset for Ifx_PSI5_RDM_L_Bits.CRC */
#define IFX_PSI5_RDM_L_CRC_OFF (1u)

/** \brief Length for Ifx_PSI5_RDM_L_Bits.RD */
#define IFX_PSI5_RDM_L_RD_LEN (28u)

/** \brief Mask for Ifx_PSI5_RDM_L_Bits.RD */
#define IFX_PSI5_RDM_L_RD_MSK (0xfffffffu)

/** \brief Offset for Ifx_PSI5_RDM_L_Bits.RD */
#define IFX_PSI5_RDM_L_RD_OFF (4u)

/** \brief Length for Ifx_PSI5_RDM_H_Bits.TS */
#define IFX_PSI5_RDM_H_TS_LEN (24u)

/** \brief Mask for Ifx_PSI5_RDM_H_Bits.TS */
#define IFX_PSI5_RDM_H_TS_MSK (0xffffffu)

/** \brief Offset for Ifx_PSI5_RDM_H_Bits.TS */
#define IFX_PSI5_RDM_H_TS_OFF (0u)

/** \brief Length for Ifx_PSI5_RDM_H_Bits.SC */
#define IFX_PSI5_RDM_H_SC_LEN (3u)

/** \brief Mask for Ifx_PSI5_RDM_H_Bits.SC */
#define IFX_PSI5_RDM_H_SC_MSK (0x7u)

/** \brief Offset for Ifx_PSI5_RDM_H_Bits.SC */
#define IFX_PSI5_RDM_H_SC_OFF (24u)

/** \brief Length for Ifx_PSI5_RDM_H_Bits.TEI */
#define IFX_PSI5_RDM_H_TEI_LEN (1u)

/** \brief Mask for Ifx_PSI5_RDM_H_Bits.TEI */
#define IFX_PSI5_RDM_H_TEI_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RDM_H_Bits.TEI */
#define IFX_PSI5_RDM_H_TEI_OFF (27u)

/** \brief Length for Ifx_PSI5_RDM_H_Bits.NBI */
#define IFX_PSI5_RDM_H_NBI_LEN (1u)

/** \brief Mask for Ifx_PSI5_RDM_H_Bits.NBI */
#define IFX_PSI5_RDM_H_NBI_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RDM_H_Bits.NBI */
#define IFX_PSI5_RDM_H_NBI_OFF (28u)

/** \brief Length for Ifx_PSI5_RDM_H_Bits.MEI */
#define IFX_PSI5_RDM_H_MEI_LEN (1u)

/** \brief Mask for Ifx_PSI5_RDM_H_Bits.MEI */
#define IFX_PSI5_RDM_H_MEI_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RDM_H_Bits.MEI */
#define IFX_PSI5_RDM_H_MEI_OFF (29u)

/** \brief Length for Ifx_PSI5_RDM_H_Bits.NFI */
#define IFX_PSI5_RDM_H_NFI_LEN (1u)

/** \brief Mask for Ifx_PSI5_RDM_H_Bits.NFI */
#define IFX_PSI5_RDM_H_NFI_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RDM_H_Bits.NFI */
#define IFX_PSI5_RDM_H_NFI_OFF (30u)

/** \brief Length for Ifx_PSI5_RDM_H_Bits.RMI */
#define IFX_PSI5_RDM_H_RMI_LEN (1u)

/** \brief Mask for Ifx_PSI5_RDM_H_Bits.RMI */
#define IFX_PSI5_RDM_H_RMI_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RDM_H_Bits.RMI */
#define IFX_PSI5_RDM_H_RMI_OFF (31u)

/** \}  */

/******************************************************************************/

/******************************************************************************/

#endif /* IFXPSI5_BF_H */
